<?php
#--------------[ text section users ]--------------#
$textbotlang =[];
$textbotlang['users']['channel']['link'] = "не задан(перевод)";
$textbotlang['users']['channel']['text_join'] = "🔗 Подпишитесь на канал";
$textbotlang['users']['channel']['confirmjoin'] = "✅ Проверка членства";
$textbotlang['users']['channel']['confirmed'] = "Ваше членство успешно подтверждено, спасибо ❤️";
$textbotlang['users']['channel']['notconfirmed'] = "❌ Вы еще не являетесь участником канала.";


$textbotlang['users']['Rules'] = "✅Правила одобрены, и с этого момента вы можете пользоваться услугами ботов";
$textbotlang['users']['back'] = "Вы вернулись на домашнюю страницу!";
$textbotlang['users']['backorder'] = "🏠 Вернуться к информации об услуге";
$textbotlang['users']['spamtext'] = "Спам в боте";
$textbotlang['users']['online'] = "онлайн";
$textbotlang['users']['offline'] = "оффлайн";
$textbotlang['users']['unlimited'] = "неограниченно";


$textbotlang['users']['number']['false'] = "❌ Номер телефона Сахаба отсутствует, пришлите номер телефона Сахаба.";
$textbotlang['users']['number']['Warning'] = "⚠️ Ошибка при сохранении номера телефона, номер должен быть для этого аккаунта";
$textbotlang['users']['number']['erroriran'] = "Номер мобильного телефона недействителен. Принимаются только иранские номера";
$textbotlang['users']['number']['active'] = "✅Ваш номер мобильного телефона успешно подтвержден";
$textbotlang['users']['number']['Confirming'] = "📞Пожалуйста, отправьте свой номер мобильного телефона для аутентификации";


$textbotlang['users']['sell']['service_not_available'] = "⛔️ У вас нет активной услуги";
$textbotlang['users']['sell']['service_sell'] = "🛍 Приобретенные вами подписки
    ⚜️Нажмите на имя пользователя, чтобы просмотреть информацию.";
$textbotlang['users']['sell']['Service-select'] = "🛒местоположение получено, выберите услугу, которую хотите купить.";
$textbotlang['users']['sell']['Service-Location'] = "❌Ошибка
        📝Местоположение услуги неверно";
$textbotlang['users']['sell']['error-product'] = "❌ Ошибка
        📝 Нет выбранного товара";
$textbotlang['users']['sell']['None-credit'] = "🚨 При оформлении заказа произошла ошибка.
📝 Причина ошибки: Баланса вашего аккаунта пользователя недостаточно, сначала необходимо пополнить аккаунт.

❌ Чтобы пополнить свой счет, выберите один из следующих способов оплаты.";
$textbotlang['users']['sell']['ErrorConfig'] = "❌ При создании подписки произошла ошибка. Чтобы устранить проблему, обратитесь в службу поддержки.";
$textbotlang['users']['sell']['selectpayment'] = "📌 Выберите способ оплаты из списка выше";
    
    
$textbotlang['users']['stateus']['notUsername'] = "⭕️ Уважаемый пользователь, если вашего имени пользователя нет в списке выше. Нажмите кнопку ниже.";
$textbotlang['users']['stateus']['notUsernameget'] = "Нет имени пользователя";
$textbotlang['users']['stateus']['SendUsername'] = "Отправьте свое имя пользователя";
$textbotlang['users']['stateus']['active'] = "✅ Активен";
$textbotlang['users']['stateus']['limited'] = "🚫 Конец объема (перевод.ред)";
$textbotlang['users']['stateus']['onhold'] = "⏳не подключено";
$textbotlang['users']['stateus']['disabled'] = "❌ отключено";
$textbotlang['users']['stateus']['expired'] = "🔚 время обслуживания истекло";
$textbotlang['users']['stateus']['Unlimited'] = "Неограниченно";
$textbotlang['users']['stateus']['day'] = "день";
$textbotlang['users']['stateus']['Notconsumed'] = "Не использовано";
$textbotlang['users']['stateus']['username'] = "Имя пользователя: ";
$textbotlang['users']['stateus']['stateus'] = "Статус:";
$textbotlang['users']['stateus']['expirationDate'] = "Срок действия:";
$textbotlang['users']['stateus']['daysleft'] = "Осталось время обслуживания:";
$textbotlang['users']['stateus']['usedTrafficGb'] = "Использованный объем услуги:";
$textbotlang['users']['stateus']['LastTraffic'] = "Общий объем услуг:";
$textbotlang['users']['stateus']['RemainingVolume'] = "Оставшийся объем услуги:";
$textbotlang['users']['stateus']['info'] = "📊 Информация об услуге:";
$textbotlang['users']['stateus']['error'] = "Произошла ошибка";
$textbotlang['users']['stateus']['usernotfound'] = "❌ На сервере нет пользователя";
$textbotlang['users']['stateus']['getlinksub'] = "🔗 Получить ссылку на подписку";
$textbotlang['users']['stateus']['linksub'] = "🔗 Ссылка для подписки";
$textbotlang['users']['stateus']['backlist'] = "🏠 Вернуться к списку услуг";
$textbotlang['users']['stateus']['backservice'] = "🏠 вернуться к профилю сервиса";
$textbotlang['users']['stateus']['Invalidusername'] = "❌ Недопустимое имя пользователя.
🔄 Повторно отправьте свое имя пользователя";
$textbotlang['users']['stateus']['manageService'] = "⚙️ Настройки сервиса";
$textbotlang['users']['stateus']['DecManageService '] = "В этом разделе вы можете управлять своим сервисом";
$textbotlang['users']['stateus']['config'] ="🔰 ручная настройка";
$textbotlang['users']['stateus']['notconnected'] ="не подключено";


$textbotlang['users']['extend']['title'] ="📌Продление сервиса";
$textbotlang['users']['extend']['confirm'] = "Подтверждение продления";
$textbotlang['users']['extend']['thanks'] = "Спасибо за продление вашего сервиса🙏

⭕️ Ваше продление успешно выполнено, спасибо за ваш платеж.
 
⬅️ Чтобы вернуться к списку своих услуг или просмотреть информацию, нажмите на кнопки ниже.";
$textbotlang['users']['extend']['error'] = "❌Произошла ошибка. Свяжитесь со службой поддержки, чтобы решить проблему";
$textbotlang['users']['extend']['selectservice'] = " 🛍 Выберите свою услугу для продления";



$textbotlang['users']['Extra_volume']['SetPrice'] = "⭕️ Отправьте цену, которую вы хотите установить за каждый гигабайт дополнительного объема.  
Текущая цена:";
$textbotlang['users']['Extra_volume']['ChangedPrice'] = "✅ Сумма успешно сохранена.";
$textbotlang['users']['Extra_volume']['sellextra'] = "➕Приобретение дополнительного объема";
$textbotlang['users']['Extra_volume']['extraadded'] = "✅ Объем успешно добавлен к вашему сервису.";
$textbotlang['users']['Extra_volume']['extracheck'] = "Подтверждение и получение дополнительного объема";
$textbotlang['users']['Extra_volume']['invalidprice'] = "Минимальный объем составляет 1 гигабайт";

$textbotlang['users']['usertest']['limitwarning'] = "⚠️ Срок действия вашего лимита на создание тестовой подписки истек.";
$textbotlang['users']['usertest']['errorcreat'] = "❌Произошла ошибка при создании подписки. Для устранения проблемы свяжитесь с поддержкой.";
$textbotlang['users']['usertest']['iduser'] = "Идентификационный номер пользователя";
$textbotlang['users']['usertest']['phonenumber'] = "Номер телефона пользователя";
$textbotlang['users']['usertest']['namepanel'] = "Название панели";




$textbotlang['users']['help']['disablehelp'] = "Раздел -Обучение- в настоящее время отключен.😔";
$textbotlang['users']['help']['btninlinebuy'] = "📚Посмотреть инструкцию по использованию ";


$textbotlang['users']['support']['sendmessageadmin'] = "🚀Ваше сообщение отправлено, ожидайте ответа от администрации.  ";
$textbotlang['users']['support']['answermessage'] = "Ответ на сообщение";
$textbotlang['users']['support']['sendmessageuser'] = "📨 Для связи с поддержкой отправьте ваше сообщение. ";
$textbotlang['users']['support']['btnsupport'] = "☎️ В кнопке ниже (часто задаваемые вопросы) представлены ваши часто задаваемые вопросы. Нажмите на кнопку ниже, если не нашли свой вопрос, нажмите кнопку поддержки. ";


$textbotlang['users']['Balance']['priceinput'] = "💸 Введите сумму в туманах: 
✅ Максимальная сумма составляет 10.000.000 миллионов туманов.";
$textbotlang['users']['Balance']['errorprice'] = "❌ Ошибка
💬 Пожалуйста, введите только число.
Числа должны быть написаны латиницей (клавиатура на английском).";
$textbotlang['users']['Balance']['errorpricelimit'] = "❌ Ошибка
        💬 Сумма должна быть меньше 10 миллионов туменов и больше 20 тысяч туменов.";
$textbotlang['users']['Balance']['selectPatment'] = "💵 Выберите способ оплаты";
$textbotlang['users']['Balance']['nowpayments'] = "❌ Ошибка 
    Минимальная сумма для оплаты в этом шлюзе составляет 1 доллар.";
$textbotlang['users']['Balance']['zarinpal'] = "❌ Ошибка 
    Минимальная сумма для оплаты в этом шлюзе составляет 5000 томанов.";
$textbotlang['users']['Balance']['linkpayments'] = "Создание ссылки на оплату...";
$textbotlang['users']['Balance']['payments'] = "Оплата";
$textbotlang['users']['Balance']['changeto'] = "❌ Ошибка 
    Минимальная сумма для оплаты в этом шлюзе составляет 2 трон.";
$textbotlang['users']['Balance']['errorLinkPayment'] = "❌ Произошла ошибка при создании ссылки на оплату, для решения проблемы свяжитесь с поддержкой.";
$textbotlang['users']['Balance']['reject_pay']  = "❌ Оплата отклонена";
$textbotlang['users']['Balance']['Confirmpayadmin']  = "⭕️ Оплата уже подтверждена";
$textbotlang['users']['Balance']['finished'] = "Ваш платеж успешно подтвержден";
$textbotlang['users']['Balance']['sending'] = "Платеж получен и находится на проверке, пожалуйста, подождите";
$textbotlang['users']['Balance']['expired'] = "Время ссылки на оплату истекло и не подлежит проверке";
$textbotlang['users']['Balance']['refunded'] = "Сумма возвращена в ваш кошелек";
$textbotlang['users']['Balance']['waiting'] = "Ожидание подтверждения платежа";
$textbotlang['users']['Balance']['Failed'] = "⭕️ Ваш платеж не был подтвержден";
$textbotlang['users']['Balance']['Confirmpay']  = "✅ Уважаемый пользователь, ваш платеж успешно выполнен, и сумма была добавлена к вашему балансу";
$textbotlang['users']['Balance']['Invalid-receipt'] = "Чек недействителен, чек должен быть только изображением";
$textbotlang['users']['Balance']['Confirmpaying']  = "✅ Подтверждение платежа";
$textbotlang['users']['Balance']['Send-receipt'] ="🚀 Ваш чек отправлен, после подтверждения администрацией сумма будет зачислена на ваш кошелек";



$textbotlang['users']['changelink']['btntitle'] = "⚙️ Обновление подписки";
$textbotlang['users']['changelink']['warnchange'] = "⚠️ При обновлении ссылки подписки конфигурация вашего сервиса будет прервана, и вам необходимо будет получить новую конфигурацию или ссылку подписки в разделе настроек сервиса.";
$textbotlang['users']['changelink']['confirm'] = "Изменение ссылки подключения";
$textbotlang['users']['changelink']['confirmed'] = "✅ Ваша ссылка подключения обновлена, предыдущая конфигурация была прервана. Чтобы получить новую конфигурацию, перейдите в меню настроек сервиса и получите новую конфигурацию.";



$textbotlang['users']['removeconfig']['btnremoveuser'] = "🗑 Удалить сервис";
$textbotlang['users']['removeconfig']['rejectremove'] = "❌ Отказ от удаления";
$textbotlang['users']['removeconfig']['accepetrequest'] = "✅ Ваш запрос отправлен, после рассмотрения администрацией вы получите уведомление о результате";
$textbotlang['users']['stateus']['notusername'] = "❌ Удаление сервиса невозможно.";
$textbotlang['users']['stateus']['errorexits'] = "❌ Запрос уже был подан, пожалуйста, подождите, пока предыдущий запрос будет рассмотрен, затем отправьте новый запрос.";
$textbotlang['users']['stateus']['descriptions_removeservice'] = " Нажав кнопку \"✅ У меня есть запрос на удаление сервиса\", вы отправите запрос на удаление сервиса администрации, и после рассмотрения ваш сервис будет отменен.\n\n❌ В случае одобрения администрации оставшаяся сумма будет возвращена на ваш кошелек.\n\nСпасибо, что пользуетесь нашими услугами.";
$textbotlang['users']['stateus']['exitsrequsts'] = "❌ У вас есть поданный запрос, ожидайте рассмотрения вашего запроса, после чего вы сможете подать свой запрос на удаление.";
$textbotlang['users']['stateus']['sendrequestsremove'] = "📌 Нажав кнопку \"✅ У меня есть запрос на удаление сервиса\", вы отправите запрос на удаление сервиса администрации, и после рассмотрения ваш сервис будет отменен.\n\n❌ В случае одобрения администрации оставшаяся сумма будет возвращена на ваш кошелек.\n\nСпасибо, что пользуетесь нашими услугами.";



$textbotlang['users']['perfectmoney']['getvcode'] = "⭕️ Для пополнения баланса сначала отправьте код вашего ваучера Perfect Money";
$textbotlang['users']['perfectmoney']['getvnumber'] = "⭕️ Код ваучера получен, теперь отправьте код активации";
$textbotlang['users']['perfectmoney']['errors'] = "❌ Произошла ошибка при проверке ваучера, пожалуйста, свяжитесь с поддержкой для решения проблемы";
$textbotlang['users']['perfectmoney']['invalidvcodeorev'] = "❌ Отправленный ваучер недействителен";
$textbotlang['users']['perfectmoney']['invalidvcode'] = "❌ Отправленный код ваучера недействителен";
$textbotlang['users']['perfectmoney']['invalid_ev_number'] = "❌ Отправленный код активации недействителен";





$textbotlang['users']['perfectmoney']['getvcode'] = "⭕️ Для пополнения баланса сначала отправьте код вашего ваучера Perfect Money";
$textbotlang['users']['perfectmoney']['getvnumber'] = "⭕️ Код ваучера получен, теперь отправьте код активации";
$textbotlang['users']['perfectmoney']['errors'] = "❌ Произошла ошибка при проверке ваучера, пожалуйста, свяжитесь с поддержкой для решения проблемы";
$textbotlang['users']['perfectmoney']['invalidvcodeorev'] = "❌ Отправленный ваучер недействителен";
$textbotlang['users']['perfectmoney']['invalidvcode'] = "❌ Отправленный код ваучера недействителен";
$textbotlang['users']['perfectmoney']['invalid_ev_number'] = "❌ Отправленный код активации недействителен";



$textbotlang['users']['Discount']['getcode']  = "💝 Для получения баланса отправьте свой код подарка";
$textbotlang['users']['Discount']['notcode']  = "❌ Код недействителен";
$textbotlang['users']['Discount']['onecode']  = "⭕️ Этот код можно использовать только один раз";
$textbotlang['users']['Discount']['getcodesell']  = "🧑‍💻 Отправьте свой код скидки";
$textbotlang['users']['Discount']['correctcode']  = "🤩 Ваш код скидки был правильным, и сумма была применена к вашему счету.";
$textbotlang['users']['Discount']['erorrlimit']  = "❌ Лимит использования этого кода скидки истек";
$textbotlang['users']['Discount']['erorrlimitdiscount']  = "❌ Лимит использования этого подарочного кода истек";
$textbotlang['users']['Discount']['firstdiscount']  = "❌ Этот код скидки предназначен только для первой покупки";



#--------------[ other users ]--------------#
$textbotlang['users']['time-Service'] = "⏳ Время подписки";
$textbotlang['users']['Volume-Service'] = "🌐 Объем сервиса";
$textbotlang['users']['selectoption'] = "Выберите вариант";
$textbotlang['users']['page']['next'] = "Далее";
$textbotlang['users']['page']['previous'] = "Назад";
$textbotlang['users']['Service']['Location'] = "🌏 Выберите местоположение вашего сервиса.";
$textbotlang['users']['config'] = "Ваши настройки:";
$textbotlang['users']['Invalid-comment'] = "❌ Неверная команда ❌";
$textbotlang['users']['selectusername'] = "Отправьте ваше имя пользователя
⚠️ Имя пользователя должно быть без лишних символов, таких как @, пробелы, дефисы. 
⚠️ Имя пользователя должно быть на английском языке";
$textbotlang['users']['invalidusername'] = "❌ Неверное имя пользователя
🔄 Пожалуйста, отправьте имя пользователя снова";



$textbotlang['users']['affiliates']['setpercentage'] = "📌 Укажите процент, который вы хотите перечислить пользователю после покупки";
$textbotlang['users']['affiliates']['changedpercentage'] = "✅ Процент перечисления пользователю успешно установлен";
$textbotlang['users']['affiliates']['banner'] = "⭕️ Пожалуйста, отправьте свой баннер для привлечения партнеров 
❌ Баннер должен быть обязательно с изображением";
$textbotlang['users']['affiliates']['affiliatesyou'] = "❌ Невозможно стать партнером с этим именем пользователя";
$textbotlang['users']['affiliates']['invalidbanner'] = "❌ Отправленный баннер недействителен (баннер обязательно должен быть с изображением)";
$textbotlang['users']['affiliates']['insertbanner'] = "✅ Ваш баннер успешно зарегистрирован.";
$textbotlang['users']['affiliates']['invalidaffiliates'] = "❌ Вы не можете быть своим собственным партнером";
$textbotlang['users']['affiliates']['priceDiscount'] = "📌 Укажите сумму, которую пользователь должен получить с каждым новым партнером";
$textbotlang['users']['affiliates']['changedpriceDiscount'] = "✅ Сумма для привлечения партнеров успешно зарегистрирована";
$textbotlang['users']['affiliates']['offaffiliates'] = "❌ Раздел привлечения партнеров отключен";

#--------------[ admin ]--------------#

$textbotlang['Admin']['Back-Admin'] = "Вы вернулись в панель администратора!";
$textbotlang['Admin']['not-user'] = "Пользователь с этим идентификатором не найден";


$textbotlang['Admin']['channel']['join-channel-on'] = "Обязательное членство включено
❌❌ Для работы бота обязательное членство должно быть администратором канала.";
$textbotlang['Admin']['channel']['join-channel-off'] = "Обязательное членство выключено";
$textbotlang['Admin']['channel']['changechannel'] = "Для настройки канала обязательного членства, пожалуйста, введите идентификатор вашего канала без @.
    Ваш текущий канал: @";
$textbotlang['Admin']['channel']['setchannel'] = "🔰 Канал успешно настроен.
    Чтобы включить обязательное членство, нажмите кнопку 📣 Настроить обязательное членство в меню администратора";
    
    
    
$textbotlang['Admin']['manageadmin']['getid'] = "🌟Отправьте числовой идентификатор администратора";
$textbotlang['Admin']['manageadmin']['addadminset'] = "🥳 Администратор успешно добавлен";
$textbotlang['Admin']['manageadmin']['setrule'] = "⭕️ Отправьте уровень доступа администратора
Уровень доступа administrator имеет доступ ко всем разделам
Уровень доступа Seller имеет доступ только к разделам подтверждения платежей, услуг пользователей, статистики бота
Уровень доступа support имеет доступ к разделам услуг пользователей, ответам на сообщения поддержки";
$textbotlang['Admin']['manageadmin']['removedadmin'] = "✅ Администратор успешно удален.";
$textbotlang['Admin']['manageadmin']['invalidrule'] = "❌ Неверный уровень доступа";




$textbotlang['Admin']['manageusertest']['getidlimit'] = "⚜️ Отправьте числовой ID пользователя. Описание: в этом разделе вы можете изменить ограничение на создание тестовой учетной записи для пользователя. По умолчанию ограничение составляет 1.";
$textbotlang['Admin']['getlimitusertest']['getid'] = "Числовой ID получен, пожалуйста, отправьте количество создаваемых тестовых учетных записей.";
$textbotlang['Admin']['getlimitusertest']['setlimit'] = "Ограничение для пользователя установлено.";
$textbotlang['Admin']['getlimitusertest']['limitall'] = "Введите количество создаваемых тестовых учетных записей.";
$textbotlang['Admin']['getlimitusertest']['setlimitall'] = "Ограничение на создание учетных записей для всех пользователей установлено.";

$textbotlang['Admin']['sumuser'] = "👤 Количество пользователей";
$textbotlang['Admin']['sumusertest'] = "🖥 Общее количество тестовых учетных записей";
$textbotlang['Admin']['phpversion'] = "👨‍💻 Версия PHP хостинга";
$textbotlang['Admin']['pingbot'] = "🚀 Пинг бота";
$textbotlang['Admin']['sellservices'] = "🛍 Общие продажи";
$textbotlang['Admin']['dayListSell'] = "☀️ Продажи сегодня";
$textbotlang['Admin']['Balanceall'] = "💰 Общий баланс пользователей";
$textbotlang['Admin']['sumporoduct'] = "🛍 Общая сумма заказов";


$textbotlang['Admin']['managepanel']['selectpanel'] = "Выберите свою панель";
$textbotlang['Admin']['managepanel']['connectx-ui'] = "✅ Панель подключена";
$textbotlang['Admin']['managepanel']['errorstateuspanel'] = "Невозможно подключиться к панели 😔

⭕️ Если вы входите в домен по заявленным условиям, то данная ошибка возникает из-за того, что на хосте робота закрыт выход панели портов.

Первое решение: изменить порт панели на порты 443 или 8080, эти порты всегда открыты.
⚠️ Если на панели порт 443, то иногда работает с портом 443, иногда без порта.
Второе решение: отдать тикет в поддержку хостинга и попросить открыть порт вашей панели на сервере";
$textbotlang['Admin']['managepanel']['addpanelname']= "Чтобы добавить панель к боту, сначала отправьте имя вашей панели

⚠️ Примечание. Название панели — это имя, которое отображается во время операции поиска.";
    $textbotlang['Admin']['managepanel']['addpanelurl'] = "Имя панели сохранено. Теперь отправьте адрес вашей панели.
 ⚠️ Примечание:
 🔸Адрес панели необходимо отправлять без дашборда.
 Если порт панели — 443, вводить порт не следует. (иногда необходимо ввести порт)
 🔸 В конце адреса не должно быть /
 🔹 если вы вводите IP, то он должен быть http или https";
$textbotlang['Admin']['managepanel']['Invalid-domain'] = "🔗 Адрес домена недействителен";
$textbotlang['Admin']['managepanel']['usernameset'] ="Адрес панели сохранен, теперь отправьте имя пользователя";
$textbotlang['Admin']['managepanel']['getpassword'] = "🔑 Введите пароль панели";
$textbotlang['Admin']['managepanel']['addedpanel'] = "Поздравляем, ваша панель успешно добавлена";
$textbotlang['Admin']['managepanel']['GetRemoveNamePanel'] = "Выберите панель, которую хотите удалить.";
$textbotlang['Admin']['managepanel']['RemovedPanel'] = "Панель успешно удалена.";
$textbotlang['Admin']['managepanel']['nullpanel'] = "⭕️ Позиция не найдена. Для решения проблемы свяжитесь с поддержкой.";
$textbotlang['Admin']['managepanel']['nullpaneladmin'] = "Панель не определена. Сначала определите панель, затем добавьте продукт.";
$textbotlang['Admin']['managepanel']['getloc'] = "Для редактирования панели отправьте имя панели.";
$textbotlang['Admin']['managepanel']['GetNameNew'] = "Отправьте новое имя панели.";
$textbotlang['Admin']['managepanel']['ChangedNmaePanel'] = "✅ Имя панели успешно изменено.";
$textbotlang['Admin']['managepanel']['geturlnew'] = "Отправьте новый адрес панели.";
$textbotlang['Admin']['managepanel']['ChangedurlPanel'] = "✅ Адрес панели успешно изменен.";
$textbotlang['Admin']['managepanel']['Repeatpanel'] = "❌ Имя панели уже зарегистрировано. Вы не можете зарегистрировать его снова.";
$textbotlang['Admin']['managepanel']['customnamesend'] = "Отправьте свой собственный текст.";
$textbotlang['Admin']['managepanel']['invalidname'] = "Имя недействительно.";
$textbotlang['Admin']['managepanel']['savedname'] = "✅ Имя успешно сохранено.";
$textbotlang['Admin']['managepanel']['getusernamenew'] = "Отправьте новое имя пользователя панели.";
$textbotlang['Admin']['managepanel']['ChangedusernamePanel'] = "✅ Имя пользователя панели успешно изменено.";
$textbotlang['Admin']['managepanel']['getpasswordnew'] = "Отправьте новый пароль панели";
$textbotlang['Admin']['managepanel']['ChangedpasswordPanel'] = "✅ Пароль панели успешно изменен.";
$textbotlang['Admin']['managepanel']['settingprotocol'] = "Выберите один из следующих вариантов для активации или деактивации протокола";
$textbotlang['Admin']['managepanel']['staatusprotocol'] = "Выберите статус протокола";
$textbotlang['Admin']['managepanel']['onprotocol'] = "Протокол успешно отключен";
$textbotlang['Admin']['managepanel']['offprotocol'] = "Протокол успешно включен";





$textbotlang['Admin']['ManageUser']['SendMessageuser'] = "✅ Сообщение успешно отправлено пользователю.";
$textbotlang['Admin']['ManageUser']['GetTextResponse'] = "Отправьте свой текст для ответа пользователю.";
$textbotlang['Admin']['ManageUser']['GetText'] = "Отправьте свой текст";
$textbotlang['Admin']['ManageUser']['ForwardGetext'] = "Отправьте свой пересылаемый текст";
$textbotlang['Admin']['ManageUser']['ForwardSendAllUser'] = "✅ Сообщение переслано всем пользователям.";
$textbotlang['Admin']['ManageUser']['MessageSent'] = "✅ Сообщение отправлено";
$textbotlang['Admin']['ManageUser']['ChangeTextGet'] = "Отправьте свой новый текст.
Текущий текст :";
$textbotlang['Admin']['ManageUser']['GetIDMessage'] = "✅ Текст получен, теперь отправьте числовой ID пользователя.";
$textbotlang['Admin']['ManageUser']['ErrorText'] = "Вы можете отправить только текст";
$textbotlang['Admin']['ManageUser']['SaveText'] = "✅ Текст успешно сохранён";
$textbotlang['Admin']['ManageUser']['BlockUserId'] = "👤 Отправьте числовой ID пользователя";
$textbotlang['Admin']['ManageUser']['BlockedUser'] = "Пользователь уже заблокирован❗️";
$textbotlang['Admin']['ManageUser']['BlockUser'] = "🚫 Пользователь заблокирован, теперь отправьте причину блокировки.";
$textbotlang['Admin']['ManageUser']['RemoveService'] = "В этом разделе вы можете удалить сервис внутри бота.
Для удаления сервиса отправьте имя пользователя, зарегистрированное в панели";
$textbotlang['Admin']['ManageUser']['RemovedService'] = "✅ Сервис пользователя удалён.";
$textbotlang['Admin']['ManageUser']['DescriptionBlock'] = "✍️ Причина блокировки пользователя сохранена";
$textbotlang['Admin']['ManageUser']['GetIdUserunblock'] = "👤 Пожалуйста, отправьте числовой ID пользователя";
$textbotlang['Admin']['ManageUser']['UserNotBlock'] = "Пользователь не заблокирован 😐";
$textbotlang['Admin']['ManageUser']['UserUnblocked'] = "Пользователь разблокирован. 🤩";
$textbotlang['Admin']['ManageUser']['Acceptedphone'] = "Подтверждено";
$textbotlang['Admin']['ManageUser']['Failedphone'] = "Не подтверждено";
$textbotlang['Admin']['ManageUser']['Userid'] = "🔵 Числовой ID пользователя";
$textbotlang['Admin']['ManageUser']['LimitUsertest'] = "🔵 Ограничение тестового аккаунта";
$textbotlang['Admin']['ManageUser']['rollUser'] = "🔵 Статус подтверждения правил";
$textbotlang['Admin']['ManageUser']['PhoneUser'] = "🔵 Номер мобильного телефона";
$textbotlang['Admin']['ManageUser']['BalanceUser'] = "🔵 Баланс пользователя";
$textbotlang['Admin']['ManageUser']['ViewInfo'] = "👀 Информация о пользователе: ";
$textbotlang['Admin']['ManageUser']['ViewOrder'] = "👁 Для просмотра заказов пользователя отправьте числовой ID пользователя";
$textbotlang['Admin']['ManageUser']['dataorder'] = " Дата не указана";
$textbotlang['Admin']['ManageUser']['SendOrder'] = "Список заказов пользователя отправлен";
$textbotlang['Admin']['ManageUser']['mangebtnuser'] = "⚙️ Управление пользователем";
$textbotlang['Admin']['ManageUser']['mangebtnuserdec'] = "⭕️ В этом разделе вы можете просмотреть всех пользователей 
⚠️ Для управления пользователем нажмите кнопку управления пользователем рядом с каждым пользователем";
$textbotlang['Admin']['ManageUser']['backlistuser'] = "🏠 Вернуться к списку пользователей";
$textbotlang['Admin']['ManageUser']['addbalanceuser'] = "👆 Увеличить баланс";
$textbotlang['Admin']['ManageUser']['lowbalanceuser'] = "👇 Уменьшить баланс";
$textbotlang['Admin']['ManageUser']['addbalanceuserdec'] = "⭕️ Отправьте сумму, которую хотите добавить";
$textbotlang['Admin']['ManageUser']['lowbalanceuserdec'] = "⭕️ Отправьте сумму, которую хотите вычесть";
$textbotlang['Admin']['ManageUser']['addbalanced'] = "✅ Баланс успешно добавлен к счету пользователя.";
$textbotlang['Admin']['ManageUser']['lowbalanced'] = "✅ Баланс успешно вычтен из счета пользователя.";
$textbotlang['Admin']['Balance']['AddBalanceUsers'] = "✅ Сумма добавлена к балансам пользователей";
$textbotlang['Admin']['ManageUser']['banuserlist'] = "🔒 Заблокировать пользователя";
$textbotlang['Admin']['ManageUser']['unbanuserlist'] = "🔓 Разблокировать пользователя";
$textbotlang['Admin']['ManageUser']['confirmnumber'] = "Подтверждение номера телефона вручную";
$textbotlang['Admin']['ManageUser']['vieworderuser'] = "🛍 Просмотреть заказы пользователя";
$textbotlang['Admin']['ManageUser']['viewpaymentuser'] = "💰 Просмотреть платежи пользователя";
$textbotlang['Admin']['ManageUser']['sendpayemntlist'] = "✅ Список платежей пользователя отправлен";
$textbotlang['Admin']['ManageUser']['removeservice'] = "❌ Удалить заказ";
$textbotlang['Admin']['ManageUser']['removeserviceandback'] = "❌ Удалить заказ и вернуть сумму";






$textbotlang['Admin']['Help']['GetAddNameHelp'] ="Чтобы добавить обучение, отправьте имя 
⚠️ Внимание: имя обучения — это то, что пользователь видит в списке.";
$textbotlang['Admin']['Help']['GetAddDecHelp'] = " 🔗 Имя обучения сохранено, теперь отправьте ваше описание 
⚠️ Внимание:
🔸 Описание можно отправить вместе с фото или видео.";
$textbotlang['Admin']['Help']['SaveHelp'] = "✅ Обучение успешно сохранено.";
$textbotlang['Admin']['Help']['SelectName'] = "Выберите имя обучения.";
$textbotlang['Admin']['Help']['RemoveHelp'] = "✅ Обучение удалено.";




$textbotlang['Admin']['Status']['btn'] ="📈 Статистика вашего бота.";
$textbotlang['Admin']['Status']['BotTitle'] = "Статус бота.";
$textbotlang['Admin']['Status']['flow'] = "Статус активации функции flow.";
$textbotlang['Admin']['Status']['onhold'] = "Статус функции первого подключения сервиса.";
$textbotlang['Admin']['Status']['onstatus'] = "Включено.";
$textbotlang['Admin']['Status']['offstatus'] = "Выключено.";
$textbotlang['Admin']['Status']['flowStatusOff'] = "flow отключен.";
$textbotlang['Admin']['Status']['flowStatuson'] = "flow включен.";
$textbotlang['Admin']['Status']['BotStatusOff'] = "❌ Бот выключен.";
$textbotlang['Admin']['Status']['BotStatuson'] = "🤖 Бот включен.";
$textbotlang['Admin']['Status']['UsernameTitle'] = "Статус кнопки имени пользователя.
Если эта функция активирована, в разделе управления сервисами добавляется кнопка, с помощью которой пользователь может отправить имя пользователя и просмотреть информацию о аккаунте.";
$textbotlang['Admin']['Status']['UsernameStatusOff'] = "Статус кнопки имени пользователя выключен";
$textbotlang['Admin']['Status']['UsernameStatuson'] = "Кнопка имени пользователя включена";
$textbotlang['Admin']['Status']['rollTitle'] = "Статус правил";
$textbotlang['Admin']['Status']['rollStatusOff'] = "❌ Правило деактивировано";
$textbotlang['Admin']['Status']['rollStatuson'] = "♨️ Правило активировано. С этого момента, если пользователь не подтвердит правила, он не сможет использовать функции бота";
$textbotlang['Admin']['Status']['phoneTitle'] = "📞 Статус проверки номера телефона";
$textbotlang['Admin']['Status']['phoneStatusOff'] = "❌ Проверка номера телефона деактивирована";
$textbotlang['Admin']['Status']['phoneStatuson'] = "🥳 Проверка номера телефона активирована. С этого момента каждый пользователь, желающий воспользоваться услугами бота, должен отправить свой номер телефона.";
$textbotlang['Admin']['Status']['HelpTitle'] = "Статус раздела обучения";
$textbotlang['Admin']['Status']['HelpStatusOff'] = "❌ Обучение деактивировано";
$textbotlang['Admin']['Status']['HelpStatuson'] = "📚 Раздел обучения включен";
$textbotlang['Admin']['Status']['PhoneIranTitle'] = "В этом разделе вы можете установить, чтобы при проверке номера телефона у пользователя принимались только иранские номера или все номера";
$textbotlang['Admin']['Status']['PhoneIranStatusOff'] = "❌ Проверка номера у пользователей с любыми номерами теперь возможна.";
$textbotlang['Admin']['Status']['PhoneIranStatuson'] = "🇮🇷 Проверка номера телефона только для иранских номеров активирована";
$textbotlang['Admin']['Status']['subTitle'] = "В этом разделе вы можете настроить, будет ли пользователь получать ссылку на подписку после покупки или нет";
$textbotlang['Admin']['Status']['subStatusOff'] = "⭕️ Отправка ссылки на подписку отключена. В дальнейшем пользователь не будет получать ссылку на подписку после покупки.";
$textbotlang['Admin']['Status']['subStatuson'] = "Ссылка на подписку активирована. В дальнейшем пользователь будет получать ссылку на подписку после покупки.";
$textbotlang['Admin']['Status']['configTitle'] = "В этом разделе вы можете определить, будет ли пользователь получать ручные конфигурации после покупки или нет";
$textbotlang['Admin']['Status']['configStatusOff'] = "⭕️ Отправка ручной конфигурации отключена. В дальнейшем пользователь не будет получать ручную конфигурацию после покупки.";
$textbotlang['Admin']['Status']['configStatuson'] = "Отправка конфигурации после покупки активирована. В дальнейшем пользователи также будут получать ручные конфигурации.";
$textbotlang['Admin']['Status']['cardTitle'] = "В этом разделе вы можете включить или выключить оффлайн-терминал";
$textbotlang['Admin']['Status']['cardStatusOff'] = "⭕ Статус оффлайн-терминала отключен";
$textbotlang['Admin']['Status']['cardStatuson'] = "Статус оффлайн-терминала включен";
$textbotlang['Admin']['Status']['nowpaymentsTitle'] = "В этом разделе вы можете активировать или деактивировать терминал NewPayments";
$textbotlang['Admin']['Status']['nowpaymentsStatusOff'] = "⭕ Статус терминала отключен";
$textbotlang['Admin']['Status']['nowpaymentsStatuson'] = "Статус терминала включен";
$textbotlang['Admin']['Status']['digiTitle'] = "В этом разделе вы можете активировать или деактивировать шлюз Digi Swap";
$textbotlang['Admin']['Status']['digiStatusOff'] = "⭕ Шлюз отключен";
$textbotlang['Admin']['Status']['digiStatuson'] = "Шлюз включен";
$textbotlang['Admin']['Status']['zarinpalTitle'] = "В этом разделе вы можете активировать или деактивировать шлюз Zarin Pal";
$textbotlang['Admin']['Status']['zarrinpalStatusOff'] = "⭕ Шлюз отключен";
$textbotlang['Admin']['Status']['zarinpalStatuson'] = "Шлюз включен";
$textbotlang['Admin']['Status']['aqayepardakhtTitle'] = "В этом разделе вы можете активировать или деактивировать шлюз Агай Пардакт";
$textbotlang['Admin']['Status']['aqayepardakhtStatusOff'] = "⭕ Шлюз отключен";
$textbotlang['Admin']['Status']['aqayepardakhtStatuson'] = "Шлюз включен";
$textbotlang['Admin']['Status']['perfectmoneyTitle'] = "В этом разделе вы можете активировать или деактивировать шлюз Perfect Money";
$textbotlang['Admin']['Status']['perfectmoneyStatusOff'] = "⭕ Шлюз отключен";
$textbotlang['Admin']['Status']['perfectmoneyStatuson'] = "Шлюз включен";
$textbotlang['Admin']['Status']['perfectmoneyTitle'] = "В этом разделе вы можете активировать или деактивировать шлюз Perfect Money";
$textbotlang['Admin']['Status']['perfectmoneyStatusOff'] = "⭕ Шлюз отключен";
$textbotlang['Admin']['Status']['perfectmoneyStatuson'] = "Шлюз включен";
$textbotlang['Admin']['Status']['affiliates'] = "📌 В этом разделе вы можете включить или отключить функцию рефералов в боте";
$textbotlang['Admin']['Status']['affiliatesStatusOff'] = "Функция рефералов отключена";
$textbotlang['Admin']['Status']['affiliatesStatuson'] = "Функция рефералов включена";
$textbotlang['Admin']['Status']['commission'] = "Статус активности функции вознаграждения после запуска бота";
$textbotlang['Admin']['Status']['commissionStatusOff'] = "Функция комиссионных отключена";
$textbotlang['Admin']['Status']['commissionStatuson'] = "Функция комиссионных включена";
$textbotlang['Admin']['Status']['Discountaffiliates'] = "Статус активности функции вознаграждения";
$textbotlang['Admin']['Status']['DiscountaffiliatesStatusOff'] = "Функция вознаграждения отключена";
$textbotlang['Admin']['Status']['DiscountaffiliatesStatuson'] = "Функция вознаграждения включена";


$textbotlang['Admin']['phone']['notactive'] = "🛑Номер мобильного телефона не подтвержден🛑";
$textbotlang['Admin']['phone']['active'] = "Номер мобильного телефона пользователя подтвержден ✅🎉";
$textbotlang['Admin']['phone']['NotSend'] = "Пользователь не отправил свой номер мобильного телефона";



$textbotlang['Admin']['Channel']['ReportChannel'] = "📣В этом разделе вы можете отправить числовой ID канала или группы для получения уведомления. 
Чтобы получить числовой ID канала, вы можете отправить сообщение в канал и переслать отправленное сообщение на указанный ниже ID, чтобы получить числовой ID. 
Для группы вы можете добавить бота и отправить команду для получения ID, чтобы получить числовой ID группы 
       @myidbot
Текущий числовой ID: "
$textbotlang['Admin']['Channel']['SetChannelReport'] ="🔰 Канал успешно настроен";
$textbotlang['Admin']['Channel']['TestChannel'] = "Тест отправки отчета канала";

$textbotlang['Admin']['Product']['Service_location'] ="📌 Выберите местоположение вашего продукта

 ⭕️ Для определения продукта во всех местоположениях отправьте команду /all";
$textbotlang['Admin']['Product']['nullpProduct']   = "⭕️ Продукт не найден, для решения проблемы свяжитесь с поддержкой";
$textbotlang['Admin']['Product']['Rmove_location'] ="📌 Выберите местоположение вашего продукта";
$textbotlang['Admin']['Product']['selectRemoveProduct'] ="Выберите продукт, который хотите удалить";
$textbotlang['Admin']['Product']['selectEditProduct'] ="Выберите продукт, который хотите отредактировать";
$textbotlang['Admin']['Product']['selectfieldProduct'] ="Выберите поле, которое хотите отредактировать";
$textbotlang['Admin']['Product']['RemoveedProduct'] ="✅ Продукт успешно удален.";
$textbotlang['Admin']['Product']['AddProductStepOne'] = "Сначала отправьте название вашей подписки
⚠️ Примечания при вводе продукта:
• Обязательно укажите цену подписки рядом с названием.
• Обязательно укажите срок подписки рядом с названием.";
$textbotlang['Admin']['Product']['GetLimit'] = "Отправьте объем подписки, обратите внимание, что единица объема - гигабайт

Если вы хотите, чтобы объем был неограниченным, отправьте число 0";
$textbotlang['Admin']['Product']['Invalidvolume'] = "Объем недействителен";
$textbotlang['Admin']['Product']['GettIime'] = "
Введите время подписки. Обратите внимание, что единицей времени является день.
Если вы хотите, чтобы время было неограниченным, отправьте число 0.";
$textbotlang['Admin']['Product']['InvalidTime'] = "Некорректное время.";
$textbotlang['Admin']['Product']['GetPrice'] = "
Отправьте цену подписки.
Обратите внимание: 
Продукт основан на туманах, и отправьте цену без каких-либо дополнительных символов.";
$textbotlang['Admin']['Product']['InvalidPrice'] = "Некорректная цена.";
$textbotlang['Admin']['Product']['SaveProduct'] = "Продукт успешно сохранен 🥳🎉";
$textbotlang['Admin']['Product']['volumeUpdated'] = "✅ Объем продукта обновлен.";
$textbotlang['Admin']['Product']['TimeUpdated'] = "✅ Время продукта обновлено.";
$textbotlang['Admin']['Product']['NewTime'] = "Отправьте новое время.";


$textbotlang['Admin']['Payment']['reviewedpayment'] = "❌ Этот платеж уже был проверен другим администратором.";
$textbotlang['Admin']['Payment']['Reasonrejecting'] = "Отправьте причину отказа в платеже.";
$textbotlang['Admin']['Payment']['Rejected'] = "⭕️ Платеж успешно отклонен, и пользователю было отправлено сообщение.";


$textbotlang['Admin']['Usertest']['TimeUpdated'] = "✅ Время тестового сервиса обновлено.";
$textbotlang['Admin']['Usertest']['VolumeUpdated'] = "✅ Объем тестового сервиса обновлен.";


$textbotlang['Admin']['Balance']['PriceBalance'] = "Получен числовой ID. Отправьте сумму, которую хотите добавить пользователю, сумма должна быть в тумах.";
$textbotlang['Admin']['Balance']['PriceBalancek'] = "Получен числовой идентификатор. Пожалуйста, отправьте сумму, которую хотите вычесть у пользователя, сумма должна быть в туманах.";
$textbotlang['Admin']['Balance']['Invalidprice'] = "Сумма недействительна.";
$textbotlang['Admin']['Balance']['AddBalanceUser'] = "✅ Сумма добавлена к балансу пользователя.";
$textbotlang['Admin']['Balance']['NegativeBalanceUser'] = "✅ Сумма вычтена из баланса пользователя.";
$textbotlang['Admin']['Balance']['addallbalance'] = "📌 Пожалуйста, отправьте сумму для общего пополнения.";




$textbotlang['Admin']['Discount']['GetCode'] = "Отправьте код для получения подарочного кода.";
$textbotlang['Admin']['Discount']['ErrorCode'] = "Код недействителен. Код должен быть обязательно на английском без лишних символов.";
$textbotlang['Admin']['Discount']['PriceCode'] = "Код получен, теперь отправьте сумму кода.";
$textbotlang['Admin']['Discount']['SaveCode'] = "✅ Код успешно зарегистрирован.";
$textbotlang['Admin']['Discount']['RemoveCode'] = "Выберите код, который хотите удалить.";
$textbotlang['Admin']['Discount']['RemovedCode'] = "✅ Код успешно удален.";
$textbotlang['Admin']['Discount']['NotCode'] = "❌ Ошибка 
📝 Выбранного подарочного кода не существует.";




$textbotlang['Admin']['Protocol']['Title'] = "В этом разделе вы можете определить, какие протоколы будут предоставлены клиенту.
📨 Для добавления протокола отправьте свой протокол из списка ниже.";
$textbotlang['Admin']['Protocol']['invalidProtocol'] = "❌ Неверный протокол.";
$textbotlang['Admin']['Protocol']['AddedProtocol'] = "✅ Протокол добавлен.";
$textbotlang['Admin']['Protocol']['RemoveProtocol'] = "Выберите протокол, который хотите удалить.";
$textbotlang['Admin']['Protocol']['RemovedProtocol'] = "Протокол успешно удален.";



$textbotlang['Admin']['AlgortimeUsername']['SaveData'] = "✅ Метод создания имени пользователя успешно обновлен.";



$textbotlang['Admin']['SettingPayment']['Savacard'] = "✅ Номер вашей карты успешно зарегистрирован.";
$textbotlang['Admin']['SettingnowPayment']['Savaapi'] = "✅ Изменения успешно сохранены.";

$textbotlang['Admin']['perfectmoney']['setnumberacount'] = "✅ Номер аккаунта успешно зарегистрирован.";


$textbotlang['Admin']['Discountsell']['GetCode'] = "Отправьте код для скидки.";
$textbotlang['Admin']['Discountsell']['getlimit'] = "Отправьте ограничение по использованию для пользователя.";
$textbotlang['Admin']['Discount']['PriceCodesell'] = "Код получен, теперь отправьте процент кода.";
$textbotlang['Admin']['Discount']['invalidcodedis'] = "❌ Скидочный код недействителен.";


$textbotlang['Admin']['mesage']['nottextmessage'] = "❌ В массовой рассылке можно отправлять только текст.";
